Центр_управления_производительностью_демо/src/DataProcessors/ПроверкаРегулярныхВыражений/ПроверкаРегулярныхВыражений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаРегулярныхВыражений</name>
  <attributes>
    <name>ШаблонПоиска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЗамены</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходныеДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Центр_управления_производительностью_демо/src/DataProcessors/ПроверкаРегулярныхВыражений/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоответсвуетШаблону(Команда)
	
	Объект.РезультатВыполнения = "";
	
	РезультатПоиска = РегулярныеВыраженияКлиентСервер.НайтиСовпаденияПоШаблонуПоиска(Объект.ВходныеДанные, Объект.ШаблонПоиска, Истина);
	РезультатМассив = Новый Массив;
	Если РезультатПоиска.Количество() > 0 Тогда
		Для Каждого ТекСовпадение Из РезультатПоиска Цикл
			РезультатМассив.Добавить(ТекСовпадение[0]);
		КонецЦикла;
	КонецЕсли;
	
	Если РегулярныеВыраженияКлиентСервер.СоответствуетШаблонуПоиска(Объект.ВходныеДанные, Объект.ШаблонПоиска) Тогда
		РезультатМассив.Добавить("Соответствует шаблону: ДА");
	Иначе
		РезультатМассив.Добавить("Соответствует шаблону: НЕТ");
	КонецЕсли;
	
	Объект.РезультатВыполнения = СтрСоединить(РезультатМассив, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	
	Объект.РезультатВыполнения = РегулярныеВыраженияКлиентСервер.ЗаменитьПоШаблонуПоиска(Объект.ВходныеДанные, Объект.ШаблонПоиска, Объект.ШаблонЗамены);
	
КонецПроцедуры

#КонецОбласти
